benchmarks/10-1.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn
Server Hostname:        localhost
Server Port:            5000

Document Path:          /admin
Document Length:        55 bytes

Concurrency Level:      1
Time taken for tests:   0.020 seconds
Complete requests:      10
Failed requests:        0
Non-2xx responses:      10
Total transferred:      2420 bytes
HTML transferred:       550 bytes
Requests per second:    501.10 [#/sec] (mean)
Time per request:       1.996 [ms] (mean)
Time per request:       1.996 [ms] (mean, across all concurrent requests)
Transfer rate:          118.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     1    2   1.1      1       3
Waiting:        1    2   1.0      1       3
Total:          1    2   1.1      1       4

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      3
  80%      3
  90%      4
  95%      4
  98%      4
  99%      4
 100%      4 (longest request)