benchmarks/500-5.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/3.1.3
Server Hostname:        localhost
Server Port:            5000

Document Path:          /admin
Document Length:        56243 bytes

Concurrency Level:      5
Time taken for tests:   1.244 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      28225500 bytes
HTML transferred:       28121500 bytes
Requests per second:    402.06 [#/sec] (mean)
Time per request:       12.436 [ms] (mean)
Time per request:       2.487 [ms] (mean, across all concurrent requests)
Transfer rate:          22164.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    11   12   0.8     12      16
Waiting:        1    2   0.5      1       5
Total:         11   12   0.8     12      16
WARNING: The median and mean for the waiting time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     13
  80%     13
  90%     13
  95%     14
  98%     14
  99%     15
 100%     16 (longest request)